[
  {
      "name": "Vitamin D3",
      "link": "https://www.amazon.co.uk/Vitamin-D3-4000-IU-Vegetarian/dp/B0BFF8LYR2?tag=thirdlink-21",
      "image": "https://m.media-amazon.com/images/I/71ZQFBQEWiL._AC_SL1500_.jpg",
      "description": "Vitamin D3 is crucial for maintaining strong bones, supporting your immune system, and improving your mood during the darker winter months. It helps the body absorb calcium, ensuring your bones stay healthy while also supporting a balanced immune response. This supplement provides a high-potency dose of Vitamin D3 in an easy-to-swallow capsule, perfect for daily use during the winter season.",
      "price": "Check Latest Price"
  },
  {
      "name": "Vitamin C",
      "link": "https://www.amazon.co.uk/dp/B00020IBF4?tag=thirdlink-21",
      "image": "https://m.media-amazon.com/images/I/51EOsaqbrPL._AC_SL1040_.jpg",
      "description": "Vitamin C is essential for boosting immunity and helping the body combat winter colds and flu. It acts as a powerful antioxidant that protects cells from damage and supports the production of collagen for skin health. This product provides a potent dose of Vitamin C, helping to keep your immune system strong throughout the winter.",
      "price": "Check Latest Price"
  },
  {
      "name": "Zinc",
      "link": "https://www.amazon.co.uk/dp/B00020ICLC?tag=thirdlink-21",
      "image": "https://m.media-amazon.com/images/I/51qAdktudHL._AC_SL1040_.jpg",
      "description": "Zinc plays a vital role in immune function and can help shorten the duration of colds and infections. It supports the production of immune cells and maintains the integrity of skin barriers, the body’s first line of defense. This high-quality zinc supplement is ideal for daily use, ensuring your immune system stays robust during the winter.",
      "price": "Check Latest Price"
  },
  {
      "name": "Elderberry Syrup",
      "link": "https://www.amazon.co.uk/dp/B008DRYPX0?tag=thirdlink-21",
      "image": "https://m.media-amazon.com/images/I/61SBKZY7+QL._AC_SL1000_.jpg",
      "description": "Elderberry is known for its antiviral properties and ability to reduce cold and flu symptoms. Packed with antioxidants, elderberry supports the immune system and helps reduce inflammation during winter. This elderberry syrup is delicious and easy to take daily, providing natural support for winter wellness.",
      "price": "Check Latest Price"
  },
  {
      "name": "Omega-3 Fish Oil",
      "link": "https://www.amazon.co.uk/dp/B07649WV5Y?tag=thirdlink-21",
      "image": "https://m.media-amazon.com/images/I/613nXHpl4EL._AC_SL1500_.jpg",
      "description": "Omega-3s are important for brain function, cardiovascular health, and reducing inflammation, especially in colder months. They provide essential fatty acids that the body cannot produce on its own, supporting overall health and well-being. This supplement contains a balanced ratio of EPA and DHA, sourced from pure fish oil, ideal for daily intake.",
      "price": "Check Latest Price"
  },
  {
      "name": "Probiotics",
      "link": "https://www.amazon.co.uk/dp/B092Q8SGPT?tag=thirdlink-21",
      "image": "https://m.media-amazon.com/images/I/61jYCljpQaL._AC_SL1500_.jpg",
      "description": "Probiotics support gut health, which is closely linked to immune function, making them especially important during winter. They help balance gut bacteria, which in turn supports digestion and the body’s ability to fight off pathogens. This multi-strain probiotic is designed for daily use to keep your digestive system and immunity in top shape.",
      "price": "Check Latest Price"
  },
  {
      "name": "Magnesium",
      "link": "https://www.amazon.co.uk/dp/B08WPLW4VN?tag=thirdlink-21",
      "image": "https://m.media-amazon.com/images/I/61YsUQR7ppL._AC_SL1500_.jpg",
      "description": "Magnesium helps with muscle relaxation, stress relief, and sleep quality, all of which can be affected during the winter. It supports over 300 biochemical reactions in the body, from energy production to nerve function. This magnesium supplement is gentle on the stomach and provides optimal absorption for daily use.",
      "price": "Check Latest Price"
  },
  {
      "name": "Astragalus Root",
      "link": "https://www.amazon.co.uk/dp/B07ZRW72Q9?tag=thirdlink-21",
      "image": "https://m.media-amazon.com/images/I/61vVQZjJjsL._AC_SL1500_.jpg",
      "description": "Astragalus is an adaptogen that boosts immunity and helps the body adapt to stress, making it perfect for winter resilience. It supports the body’s immune response and helps protect against seasonal infections. This astragalus extract comes in easy-to-take capsules, providing a natural boost to your winter wellness routine.",
      "price": "Check Latest Price"
  },
  {
      "name": "Curcumin",
      "link": "https://www.amazon.co.uk/dp/B01DL23FAA?tag=thirdlink-21",
      "image": "https://m.media-amazon.com/images/I/51brlTrDUsL._AC_SL1000_.jpg",
      "description": "Curcumin, the active ingredient in turmeric, is known for its anti-inflammatory properties, making it beneficial for joint health. It reduces inflammation throughout the body, which can be particularly helpful for joint pain in colder weather. This high-potency curcumin supplement is formulated with black pepper extract to enhance absorption.",
      "price": "Check Latest Price"
  },
  {
      "name": "B-Complex Vitamins",
      "link": "https://www.amazon.co.uk/dp/B01787EPEE?tag=thirdlink-21",
      "image": "https://m.media-amazon.com/images/I/61mwLOKjj7L._AC_SL1500_.jpg",
      "description": "B vitamins are essential for energy production, nerve health, and mood regulation, which can be affected during winter. They support metabolism and help convert food into energy, reducing winter fatigue. This balanced B-complex supplement provides all eight B vitamins in one convenient capsule.",
      "price": "Check Latest Price"
  }
]